Revit 2024 API
BuiltInFailures.StairRampFailures.TooShortCurveDowngradeGeometry Property
 Curve is too short and may downgrade the geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TooShortCurveDowngradeGeometry { get; }
Visual Basic
Public Shared ReadOnly Property TooShortCurveDowngradeGeometry As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TooShortCurveDowngradeGeometry {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace